## Plan Result (prod_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.api-mgmt.azurerm_api_management_logger.apim
  * module.api-mgmt.module.application_insights.azurerm_application_insights.this
* Move
  * module.api-mgmt.azurerm_application_insights.apim => module.api-mgmt.module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.azurerm_api_management_logger.apim must be replaced
-/+ resource "azurerm_api_management_logger" "apim" {
      ~ id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/loggers/cft-api-mgmt-prod-logger" -> (known after apply)
        name                = "cft-api-mgmt-prod-logger"
      ~ resource_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-prod" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ application_insights {
          ~ instrumentation_key = (sensitive value)
        }
    }

  # module.api-mgmt.module.application_insights.azurerm_application_insights.this must be replaced
  # (moved from module.api-mgmt.azurerm_application_insights.apim)
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "c7ae8e7d-f5a3-4a02-ab95-cc90fc8ba074" -> (known after apply)
      ~ application_type                      = "other" -> "web" # forces replacement
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Insights/components/cft-api-mgmt-prod" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "cft-api-mgmt-prod"
      ~ retention_in_days                     = 30 -> 90
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      + workspace_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1933,"Program":"tfcmt","SHA1":"","Target":"prod_apim","Vars":{}} -->